{"links": {"self": {"href": "data/repositories/osrf/subt/issues/160/comments/53599679.json"}, "html": {"href": "#!/osrf/subt/issues/160#comment-53599679"}}, "issue": {"links": {"self": {"href": "data/repositories/osrf/subt/issues/160.json"}}, "type": "issue", "id": 160, "repository": {"links": {"self": {"href": "data/repositories/osrf/subt.json"}, "html": {"href": "#!/osrf/subt"}, "avatar": {"href": "data/bytebucket.org/ravatar/{3c95f6ad-c304-407c-b838-09597d836552}ts=2272898"}}, "type": "repository", "name": "subt", "full_name": "osrf/subt", "uuid": "{3c95f6ad-c304-407c-b838-09597d836552}"}, "title": "Cameras without propellers in view?"}, "content": {"raw": "Is it possible to add optional parameters for mounting points for certain sensors \\(i.e. camera\\)?  As long as they’re within some specified bounds or it defaults to the default parameter there should not be an exploit opened up by this.\n\nLuckily there is a configuration that allows the camera to unobstructed for X3 but this is not the case for X4.  If the competitors were able to change the location of the camera on X4 themselves to decide how much they are willing to have obstructed that would increase the amount of versatility.  Moving the camera forward in body-frame X will have an impact on the control of the vehicle which is fine due to the current state of `cmd_vel` being forces as opposed to velocities feeding into some black-box autopilot.", "markup": "markdown", "html": "<p>Is it possible to add optional parameters for mounting points for certain sensors (i.e. camera)?  As long as they’re within some specified bounds or it defaults to the default parameter there should not be an exploit opened up by this.</p>\n<p>Luckily there is a configuration that allows the camera to unobstructed for X3 but this is not the case for X4.  If the competitors were able to change the location of the camera on X4 themselves to decide how much they are willing to have obstructed that would increase the amount of versatility.  Moving the camera forward in body-frame X will have an impact on the control of the vehicle which is fine due to the current state of <code>cmd_vel</code> being forces as opposed to velocities feeding into some black-box autopilot.</p>", "type": "rendered"}, "created_on": "2019-08-26T13:39:28.152983+00:00", "user": {"display_name": "Arthur Schang", "uuid": "{1403972a-9b64-442b-a69c-d7e9557e1d87}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B1403972a-9b64-442b-a69c-d7e9557e1d87%7D"}, "html": {"href": "https://bitbucket.org/%7B1403972a-9b64-442b-a69c-d7e9557e1d87%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/initials/AS-0.png"}}, "nickname": "Arthur Schang", "type": "user", "account_id": "557058:14b7fd50-d65a-47a8-825c-fa89681d07bd"}, "updated_on": null, "type": "issue_comment", "id": 53599679}