{"links": {"self": {"href": "data/repositories/osrf/subt/pullrequests/342/comments/126261481.json"}, "html": {"href": "#!/osrf/subt/pull-requests/342/_/diff#comment-126261481"}}, "parent": {"id": 126258867, "links": {"self": {"href": "data/repositories/osrf/subt/pullrequests/342/comments/126258867.json"}, "html": {"href": "#!/osrf/subt/pull-requests/342/_/diff#comment-126258867"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 342, "links": {"self": {"href": "data/repositories/osrf/subt/pullrequests/342.json"}, "html": {"href": "#!/osrf/subt/pull-requests/342"}}, "title": "Model submission for X4 sensor configuration 6 by SSCI."}, "content": {"raw": "Actually, yeah you’re right we’ll need to add the config6 cases back for whenever this is merged into the `competition.ign` launch file.\n\nThe issue is in `competition.ign`, `spawnx4` is a single function that contains the ROS executables as well whereas for `spawner.rb` , they’re two separate functions and those parameters are not passed into the `rosExecutables` function. I think that your approach is what we should move to but there may be a specific reason @{557058:90bc87b0-2886-4377-a17c-3a6629a697ff}  split ROS executables into a separate function. The fact that the parameters are hard-coded in the `rosExecutables` function does not matter at this moment since this ROS package is dedicated to only your submitted configuration.\n\nI suspect the model you have from fuel is correct, it just does not locally reference paths in addition to the aforementioned incorrect references with `spawner.rb`. We could cleanup and resolve the few issues with your submission but that would set a poor precedent. For this to scale, we need the PR authors to do most of the heavy lifting and have a functional model spawned and working with the `localModel` capability for both submission of new models and development of new models. The changes we’re looking for should not be a huge lift from what you submitted but it will take some time. I believe you will be fine to get your PR revised and merged before the deadline given your return on the 5th and if we run into subsequent issues, we can allocate some more last-minute resources to get it done.", "markup": "markdown", "html": "<p>Actually, yeah you’re right we’ll need to add the config6 cases back for whenever this is merged into the <code>competition.ign</code> launch file.</p>\n<p>The issue is in <code>competition.ign</code>, <code>spawnx4</code> is a single function that contains the ROS executables as well whereas for <code>spawner.rb</code> , they’re two separate functions and those parameters are not passed into the <code>rosExecutables</code> function. I think that your approach is what we should move to but there may be a specific reason <span class=\"ap-mention\" data-atlassian-id=\"557058:90bc87b0-2886-4377-a17c-3a6629a697ff\">@Addisu Z. Taddese</span>  split ROS executables into a separate function. The fact that the parameters are hard-coded in the <code>rosExecutables</code> function does not matter at this moment since this ROS package is dedicated to only your submitted configuration.</p>\n<p>I suspect the model you have from fuel is correct, it just does not locally reference paths in addition to the aforementioned incorrect references with <code>spawner.rb</code>. We could cleanup and resolve the few issues with your submission but that would set a poor precedent. For this to scale, we need the PR authors to do most of the heavy lifting and have a functional model spawned and working with the <code>localModel</code> capability for both submission of new models and development of new models. The changes we’re looking for should not be a huge lift from what you submitted but it will take some time. I believe you will be fine to get your PR revised and merged before the deadline given your return on the 5th and if we run into subsequent issues, we can allocate some more last-minute resources to get it done.</p>", "type": "rendered"}, "created_on": "2019-11-25T23:38:56.219105+00:00", "user": {"display_name": "Arthur Schang", "uuid": "{1403972a-9b64-442b-a69c-d7e9557e1d87}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B1403972a-9b64-442b-a69c-d7e9557e1d87%7D"}, "html": {"href": "https://bitbucket.org/%7B1403972a-9b64-442b-a69c-d7e9557e1d87%7D/"}, "avatar": {"href": "https://avatar-management--avatars.us-west-2.prod.public.atl-paas.net/initials/AS-0.png"}}, "nickname": "Arthur Schang", "type": "user", "account_id": "557058:14b7fd50-d65a-47a8-825c-fa89681d07bd"}, "updated_on": "2019-11-25T23:39:24.546881+00:00", "type": "pullrequest_comment", "id": 126261481}