{"links": {"self": {"href": "data/repositories/osrf/subt/issues/88/comments/52962363.json"}, "html": {"href": "#!/osrf/subt/issues/88#comment-52962363"}}, "issue": {"links": {"self": {"href": "data/repositories/osrf/subt/issues/88.json"}}, "type": "issue", "id": 88, "repository": {"links": {"self": {"href": "data/repositories/osrf/subt.json"}, "html": {"href": "#!/osrf/subt"}, "avatar": {"href": "data/bytebucket.org/ravatar/{3c95f6ad-c304-407c-b838-09597d836552}ts=2272898"}}, "type": "repository", "name": "subt", "full_name": "osrf/subt", "uuid": "{3c95f6ad-c304-407c-b838-09597d836552}"}, "title": "Missing documentation for creating Ignition-compatible docker containers"}, "content": {"raw": "I realize that since we are not even able to move a robot \\([#103](#!/osrf/subt/issues/103/x1-and-x2-basic-motion)\\) this might still seem like a low priority question but we really need to know how the docker image we upload interacts with the simulation in the cloud. Our expectation is that the simulation runs outside of our docker container. We also expect there is going to be one docker container per robot controller \\(it has been mentioned in comments to other issues\\). It would be extremely useful being able to recreate this multicontainer setup locally to properly test everything. Can you please clarify this as soon as possible?\n\nIf our expectations are correct, can you please publish the docker image for running the simulation server \\(ie. running rosmaster that we can connect to over the network\\)? Can this docker image be prebuilt, tested and ready to run? I think it is not necessary to drag everyone through the installation of everything ign related while we can just install ROS libraries into our controller image and use your prebuilt image to run the simulation server.\n\nIt also neatly solves the issue [#95](#!/osrf/subt/issues/95/problems-stopping-all-processes-associated) because we just shutdown your container and be done with it. You get the time you need to work on the issues and we get something to work with like right now. Win-win.", "markup": "markdown", "html": "<p>I realize that since we are not even able to move a robot (<a data-is-external-link=\"true\" href=\"#!/osrf/subt/issues/103/x1-and-x2-basic-motion\" rel=\"nofollow\">#103</a>) this might still seem like a low priority question but we really need to know how the docker image we upload interacts with the simulation in the cloud. Our expectation is that the simulation runs outside of our docker container. We also expect there is going to be one docker container per robot controller (it has been mentioned in comments to other issues). It would be extremely useful being able to recreate this multicontainer setup locally to properly test everything. Can you please clarify this as soon as possible?</p>\n<p>If our expectations are correct, can you please publish the docker image for running the simulation server (ie. running rosmaster that we can connect to over the network)? Can this docker image be prebuilt, tested and ready to run? I think it is not necessary to drag everyone through the installation of everything ign related while we can just install ROS libraries into our controller image and use your prebuilt image to run the simulation server.</p>\n<p>It also neatly solves the issue <a data-is-external-link=\"true\" href=\"#!/osrf/subt/issues/95/problems-stopping-all-processes-associated\" rel=\"nofollow\">#95</a> because we just shutdown your container and be done with it. You get the time you need to work on the issues and we get something to work with like right now. Win-win.</p>", "type": "rendered"}, "created_on": "2019-07-12T15:14:03.230481+00:00", "user": {"display_name": "Zbyněk Winkler", "uuid": "{d253a02a-aa23-4c28-9bf2-75863acb0ee0}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Bd253a02a-aa23-4c28-9bf2-75863acb0ee0%7D"}, "html": {"href": "https://bitbucket.org/%7Bd253a02a-aa23-4c28-9bf2-75863acb0ee0%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/326a12c819c60ee18418b5d01000d03fd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsZW-1.png"}}, "nickname": "Zbyněk Winkler (robotika)", "type": "user", "account_id": "557058:a92b5a4f-5b91-4853-8dec-b918bd975e70"}, "updated_on": null, "type": "issue_comment", "id": 52962363}